erp3l/src/Catalogs/АнкетыПоставщиков/АнкетыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АнкетыПоставщиков</name>
  <predefined>
    <items>
      <name>СаморегистрацияПоставщика</name>
      <description>Саморегистрация поставщика</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийПользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторВидовЭкономическойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБВременныйПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрошелПроверкуЕГРН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКонтрагента</name>
    <type>
      <types>EnumRef.СостоянияСуществованияКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СПравиламиОзнакомлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СубъектМалогоИлиСреднегоПредпринимательстваУХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Факс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПоставщика</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеЭТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоНаСпецрежиме422ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеЭТП</name>
    <attributes>
      <name>ЭТП</name>
      <type>
        <types>CatalogRef.КлассификаторЭТП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/АнкетыПоставщиков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК КодОшибки
		|ИЗ
		|	Справочник.АнкетыПоставщиков КАК АнкетыПоставщиков
		|ГДЕ
		|	АнкетыПоставщиков.ИНН = &ИНН
		|	И АнкетыПоставщиков.КПП = &КПП
		|	И АнкетыПоставщиков.Ссылка <> &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 2
		|	2
		|ИЗ
		|	Справочник.АнкетыПоставщиков КАК АнкетыПоставщиков
		|ГДЕ
		|	АнкетыПоставщиков.РегистрационныйНомер = &РегистрационныйНомер
		|	И АнкетыПоставщиков.СтранаРегистрации = &СтранаРегистрации
		|	И АнкетыПоставщиков.Ссылка <> &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 3
		|	3
		|ИЗ
		|	Справочник.АнкетыПоставщиков КАК АнкетыПоставщиков
		|ГДЕ
		|	АнкетыПоставщиков.АдресЭП = &АдресЭП
		|	И АнкетыПоставщиков.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("РегистрационныйНомер", РегистрационныйНомер);
	Запрос.УстановитьПараметр("СтранаРегистрации", СтранаРегистрации);
	Запрос.УстановитьПараметр("АдресЭП", АдресЭП);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзЗапроса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаИзЗапроса.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Если ВыборкаИзЗапроса.КодОшибки = 1 Тогда
			ТекстСообщения = НСтр("ru = 'Запрос на регистрацию поставщика с ИНН/КПП %ИНН%/%КПП% уже был зарегистрирован.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИНН%", Строка(ИНН));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КПП%", Строка(КПП));
			Сообщение.Текст = ТекстСообщения;
		ИначеЕсли ВыборкаИзЗапроса.КодОшибки = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Запрос на регистрацию поставщика с регистрационным номером %РегистрационныйНомер% (страна регистрации %СтранаРегистрации%) уже был зарегистрирован.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%РегистрационныйНомер%", Строка(РегистрационныйНомер));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтранаРегистрации%", Строка(СтранаРегистрации));
			Сообщение.Текст = ТекстСообщения;
		ИначеЕсли ВыборкаИзЗапроса.КодОшибки = 3 Тогда
			ТекстСообщения = НСтр("ru = 'Запрос на регистрацию поставщика с e-mail %АдресЭП% уже был зарегистрирован.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%АдресЭП%", Строка(АдресЭП));
			Сообщение.Текст = ТекстСообщения;
		КонецЕсли;
		
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;
	ОбновитьПредставлениеАдресовВОбъекте();
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (ЮридическоеФизическоеЛицо =
				Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			ИЛИ НЕ ФизЛицоНаСпецрежиме422ФЗ Тогда
		ПроверяемыеРеквизиты.Добавить("РегистрационныйНомер");		
	КонецЕсли;
	Если Справочники.АнкетыПоставщиков.ПроверитьКорректностьИмениПользователяИБ(ВнешнийПользователь, ПользовательИБИмя) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректное имя пользователя.'");
		Сообщение.Поле = "ПользовательИБИмя";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ПользовательИБВременныйПароль = АккредитацияПоставщиковУХ.СоздатьПарольВнешнегоПользователя();
	
	ЭтоВнешнийПользователь = ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя();
	Если НЕ ЭтоВнешнийПользователь Тогда
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьПредставлениеАдресовВОбъекте() Экспорт
	ФактическийАдресСтрокой = 
		УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ФактическийАдрес);
	ЮридическийАдресСтрокой = 
		УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЮридическийАдрес);
КонецПроцедуры

#КонецЕсли
